package miniproject;

import java.util.Scanner;

public class Minigame {

	Scanner sc = new Scanner(System.in);
	boolean result = true;

	// 난이도 level1 => 신조어 퀴즈
	public boolean level1() {
		System.out.println("------------------------------------------------");
		System.out.println("Level 1을 선택하셨습니다.  ★넌센스 퀴즈★");
		System.out.println("------------------------------------------------");
		System.out.println("문제 >> 딸기가 회사에서 짤리면?");
		System.out.println("------------------------------------------------");
		System.out.print("[1]정답 입력 [2]증거 획득 포기 ");
		
		
		int choice = sc.nextInt();
		if(choice == 1) {
			System.out.print("정답을 입력하세요(4글자) >> ");
			String correct = sc.next();
			if (correct.equals("딸기시럽")) {
				System.out.println("♥정답입니다♥ 증거를 획득했습니다~!~!");
				System.out.println("------------------------------------------------");
				return true;
			} else {
				System.out.println("틀렸습니다ㅜㅡㅜ  증거 획득 실패~!");
				System.out.println("------------------------------------------------");
				return false;
			}
		}else{
			System.out.println("미니게임을 포기하셨습니다.  증거 획득 실패~!");
			System.out.println("------------------------------------------------");
			return false; 
		}
		
		

	}

	// 난이도 level2 => 신조어 퀴즈
	public boolean level2() {
		System.out.println("------------------------------------------------");
		System.out.println("Level 2를 선택하셨습니다.  ★신조어 퀴즈★");
		System.out.println("------------------------------------------------");
		System.out.println("문제 >> '아까 네넴띤 맛있었지?'에서 '네넴띤'은 무엇일까요?");
		System.out.println("------------------------------------------------");
		System.out.print("[1]정답 입력 [2]증거 획득 포기 ");
		
		int choice = sc.nextInt();
		if(choice == 1) {
			System.out.print("정답을 입력하세요 >> ");
			String correct = sc.next();
			if (correct.equals("비빔면")) {
				System.out.println("♥정답입니다♥ 증거를 획득했습니다~!~!");
				System.out.println("------------------------------------------------");
				return true;		
			} else {
				System.out.println("틀렸습니다ㅜㅡㅜ  증거 획득 실패~!");
				System.out.println("------------------------------------------------");
				return false;
			}
		}else {
			System.out.println("미니게임을 포기하셨습니다.  증거 획득 실패~!");
			System.out.println("------------------------------------------------");
			return false;
		}

	}

	// 난이도 level3 => 신조어 퀴즈
	public boolean level3() {
		System.out.println("Level 3을 선택하셨습니다.  ★신조어 퀴즈★");
		System.out.println("------------------------------------------------");
		System.out.println("문제 >> '오저치고'는 무엇의 줄임말일까요?");
		System.out.println("------------------------------------------------");
		System.out.print("[1]정답 입력 [2]증거 획득 포기 ");
		int choice = sc.nextInt();
		if(choice == 1) {
			System.out.print("정답을 입력하세요(7글자) >> ");
			String correct = sc.next();
			if (correct.equals("오늘저녁치킨고")) {
				System.out.println("♥정답입니다♥ 증거를 획득했습니다~!~!");
				System.out.println("------------------------------------------------");
				return true;
			} else {
				System.out.println("틀렸습니다ㅜㅡㅜ  증거 획득 실패~!");
				System.out.println("------------------------------------------------");
				return false;
			}
		}else{
			System.out.println("미니게임을 포기하셨습니다.  증거 획득 실패~!");
			System.out.println("------------------------------------------------");
				return false;
		}

	}

	// 난이도 level4 => 두뇌 퀴즈
	public boolean level4() {
		System.out.println("Level 4를 선택하셨습니다.  ★두뇌 퀴즈★");
		System.out.println("------------------------------------------------");
		System.out.println("문제 >> 아래의 규칙을 보고 광주와 서울의 합을 구하시오.");
		System.out.println("우리나라 = 0");
		System.out.println("대한민국 = 3");
		System.out.println("대구 = 0");
		System.out.println("제주도 = 0");
		System.out.println("부산 = 1");

		System.out.println("------------------------------------------------");
		System.out.print("[1]정답 입력 [2]증거 획득 포기 ");
		int choice = sc.nextInt();
		if(choice == 1) {
			System.out.print("정답을 입력하세요 >> ");
			int correct = sc.nextInt();
			if (correct==2) {
				System.out.println("♥정답입니다♥ 증거를 획득했습니다~!~!");
				System.out.println("------------------------------------------------");
				return true;
			} else {
				System.out.println("틀렸습니다ㅜㅡㅜ  증거 획득 실패~!");
				System.out.println("------------------------------------------------");
				return false;
			}
		}else{
			System.out.println("미니게임을 포기하셨습니다.  증거 획득 실패~!");
			System.out.println("------------------------------------------------");
			return false;
		}
	}

	// 난이도 level5 => 캐치마인드
	public boolean level5() {
		System.out.println("Level 5를 선택하셨습니다.  ★캐치마인드★");
		System.out.println("-----------------------------------------------------------------------------");
		System.out.println("문제 >> 아래 그림을 보고 무엇인지 맞추시오! (힌트 : 3글자)");
		System.out.println("                                                  \n     "
				+ "                                                                 ;@@@@@@@@=              \n"
				+ "                                                                .$@@@@@@@@@*             \n"
				+ "                                                                !@@@@#**@@@@:            \n "
				+ "                                                                !@@@#-  ;@@@;    4잡아~!       \n "
				+ "                                                                -~~~-    @@@$,           \n  "
				+ "                                                                         @@@#,           \n "
				+ "           .@@@-  =@:                                                    @@@:            \n "
				+ "         #@@##@@@@#@@.                                                   @@@:            \n"
				+ "         #@    @@   @.                                 -!@;-@@=.        ;@@@:            \n "
				+ "         ## =: @# ! @.                                .@@$#@@*@:       ~@@@$-            \n "
				+ "         #@   #@@   @.                                .@=!#@#-@=.      =@@#-             \n "
				+ "         ,@#=#@@@@=#@.                                .@#=@@@$@!     ~=@@@=              \n "
				+ "          .~@@@@@@@                                    ~@@@@@@@:    -@@@@@               \n "
				+ "            -@@@@@=          도망가~!                     ~@@@@@=    @@@@@@               \n "
				+ "           -@@@@@@=                                       @@@@@=   =@@@@@------,         \n "
				+ "          ~@@@@@@@=                                      @@@@@@=   #@@@@@@@@@@@@         \n "
				+ "          #@@@@@@@=                                     @@@@@@@=   #@@@@@@@@@@@@         \n "
				+ "         ;@@@@@@@@=                                   =@@@@@@@@=  ;@@@@@@@@@@@@@*,=-     \n "
				+ "        ;@@@@@@@@@=                                   =@@@@@@@@=  ~@@@@@@@@#=@@@@#@:     \n "
				+ "       ~#@@@@@@@@@=                                   ~@@##@@@@=  :@@:         #@@@:     \n"
				+ "       !@@@@@@@@@@=                                       :@@@@=  =@#          #@@#~     \n"
				+ "      ;@@@@@@@@@@@=                                       :@@@@= ,$@#          #@@!      \n"
				+ "     ;@@@@@@!@@@@@=                                       :@@@@=,$@@:                    \n "
				+ "     @@@@@@#-@@@@@=                                       :@@@@=                         \n "
				+ "    =@@@@@@.-@@@@@=                                       :@@@@=          @@@@:$@           \n "
				+ "   =@@@@@@. -@@@@@=                                       :@@@@=        @@.@@@@@@=         \n"
				+ "  .$@@@@@@-,~@@@@@@@@@@@=                                 :@@@@=       ;@@@@@@@@@@!        \n"
				+ "  =@@@@@@@@@@@@@@@@@@@@@=                                 :@@@@=        ;*@@@@@@@@!       \n "
				+ "  @@@@@@@@@@@@@@@@@@@@@@=                                 :@@@@=                @@*       \n "
				+ " ;@@@@@@@@@@@@@@@@@@@@@@#:                                :@@@@=                @@!        \n"
				+ ",#@@@@@@@@@@@@@@@@@@@@@@@!            ;$$$$$~             :@@@@=               =@@!       \n"
				+ " :@@@@@@@@@@@@@@@@$......           -@@@@@@@@#            :@@@@=            :@@@@=       \n"
				+ "            -@@@@@=                   ,@@@@@@@@@@         :@@@@$           -@@##@@@;.      \n "
				+ "            -@@@@@=                     -#@@@@@@@@        :@$==@*-              ;$@@@~     \n "
				+ "            -@@@@@=                      ~!!!*@@@@       .*@- .@@@!              .=@@@:    \n"
				+ "            -@@@@@   #@@@$-                 -@@@@        =@@= .@@@@.              ,=@@@:    \n"
				+ "            ,#@@@@@@@@@@@@: *@@@@@@@@@@-   =$@@@-       $@@@@..@@@@.               !@@@=    \n"
				+ "            -@@@@@@@;$@@@@: #@@@@@@@@@@ -#@@@@@.      #@@@@= :@@@@.                !@@@=    \n"
				+ "            :@@@@@= !@@@@@: #@#####@@@@-  .@@@@@$     ,@@@@~  @@@@-               :@@@#     \n"
				+ "       .--.-@@@     !@@@@@:              =$@@@@@,                       ,-       ~$@@@#    \n"
				+ "      .*@@!@@$;~    !@@@@$- ~@@@@@@    .   ,$@@@@=                     *@        @@@@@!     \n"
				+ "     !*@@@@@@!      !@@@@!  =@@@@@@@@        :@@@@=                    *@@@$$@@@@@@@@     \n "
				+ "    *@@@@@@@@!       #@@$,  =@@@@@@@@@       $@@@@=                    =@@@@@@@@@@@@@     \n "
				+ "    #@@@@@@@$        =@@.     @@@@@@@@@;  $@@@@@@@=                    ..@@@@@@@@@@@/        \n"
				+ "    #@@@@@@*          ##         *@@@@: #@@@@@@#                       @@@@@@       @@@   \n"
				+ "     $$$$,                             -@@@@@$                      ,~#;,@@!        #@@@: \n"
				+ "                                #@@=.  @@@@@.                      @@@@@@#         -@@@@:  \n"
				+ "                                 #@@@=;;@@@@!                    ;@@@@@#           -#@@@=,  \n"
				+ "                                  -@@@@@@@@@@-                   :#@@@#            ,$@@~,    \n"
				+ "                                    -@@@@@@@@;                                             \n "
				+ "                                     -@@@@@@!                                              \n"
				+ "                                       $$$*       ");

		System.out.print("[1]정답 입력 [2]증거 획득 포기 ");
		int choice = sc.nextInt();
		if(choice == 1) {
			System.out.print("정답을 입력하세요(3글자) >> ");
			String correct = sc.next();
			if (correct.equals("포도주")) {
				System.out.println("♥정답입니다♥ 증거를 획득했습니다~!~!");
				System.out.println("-----------------------------------------------------------------------------");
				return true;
			} else
				System.out.println("틀렸습니다ㅜㅡㅜ  증거 획득 실패~!");
			System.out.println("-----------------------------------------------------------------------------");
				return false;
		}else{
			System.out.println("미니게임을 포기하셨습니다.  증거 획득 실패~!");
			System.out.println("-----------------------------------------------------------------------------");
			return false;
		}
	}

}
